import 'package:flutter/material.dart';
import '../../globals.dart';

class PartSeven extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text("সপ্তম ভাগঃ নির্বাচন"),
        // automaticallyImplyLeading: false,
        // actions: <Widget>[
        //   IconButton(
        //     icon: Icon(Icons.check),
        //     onPressed: () async{
        //       Navigator.pop(context);
        //     },
        //     tooltip: "Ok",
        //   ),
        // ],
        flexibleSpace: appBarStyle(),
      ),
      body: ListView(
        children: <Widget>[
          SizedBox(
            height: 10,
          ),
          Text(
            "(সপ্তম ভাগ) নির্বাচন",
            style: TextStyle(color: Colors.green[800], fontSize: 18),
            textAlign: TextAlign.center,
          ),
          SizedBox(
            height: 3,
          ),
          Divider(),
          ExpansionTile(
            title: Text('১১৮। নির্বাচন কমিশন প্রতিষ্ঠা'),
            children: <Widget>[
              ListTile(
                  title: SelectableText(
                '১১৮ ।(১) প্রধান নির্বাচন কমিশনার এবং অনধিক চার জন নির্বাচন কমিশনারকে লইয়া] বাংলাদেশের একটি নির্বাচন কমিশন থাকিবে এবং উক্ত বিষয়ে প্রণীত কোন আইনের বিধানাবলী-সাপেক্ষে রাষ্ট্রপতি প্রধান নির্বাচন কমিশনারকে ও অন্যান্য নির্বাচন কমিশনারকে নিয়োগদান করিবেন।',
                textAlign: TextAlign.justify,
              )),
              ListTile(
                  title: SelectableText(
                '(২) একাধিক নির্বাচন কমিশনারকে লইয়া নির্বাচন কমিশন গঠিত হইলে প্রধান নির্বাচন কমিশনার তাহার সভাপতিরূপে কার্য করিবেন।',
                textAlign: TextAlign.justify,
              )),
              ListTile(
                  title: SelectableText(
                '(৩) এই সংবিধানের বিধানাবলী-সাপেক্ষে কোন নির্বাচন কমিশনারের পদের মেয়াদ তাঁহার কার্যভার গ্রহণের তারিখ হইতে পাঁচ বৎসরকাল হইবে এবং \n(ক) প্রধান নির্বাচন কমিশনার-পদে অধিষ্ঠিত ছিলেন, এমন কোন ব্যক্তি প্রজাতন্ত্রের কর্মে নিয়োগলাভের যোগ্য হইবেন না; \n(খ) অন্য কোন নির্বাচন কমিশনার অনুরূপ পদে কর্মাবসানের পর প্রধান নির্বাচন কমিশনাররূপে নিয়োগলাভের যোগ্য হইবেন, তবে অন্য কোনভাবে প্রজাতন্ত্রের কর্মে নিয়োগলাভের যোগ্য হইবেন না।',
                textAlign: TextAlign.justify,
              )),
              ListTile(
                  title: SelectableText(
                '(৪) নির্বাচন কমিশন দায়িত্ব পালনের ক্ষেত্রে স্বাধীন থাকিবেন এবং কেবল এই সংবিধান ও আইনের অধীন হইবেন।',
                textAlign: TextAlign.justify,
              )),
              ListTile(
                  title: SelectableText(
                '(৫) সংসদ কর্তৃক প্রণীত যে কোন আইনের বিধানাবলী-সাপেক্ষে নির্বাচন কমিশনারদের কর্মের শর্তাবলী রাষ্ট্রপতি আদেশের দ্বারা যেরূপ নির্ধারণ করিবেন, সেইরূপ হইবে: \nতবে শর্ত থাকে যে, সুপ্রীম কোর্টের বিচারক যেরূপ পদ্ধতি ও কারণে অপসারিত হইতে পারেন, সেইরূপ পদ্ধতি ও কারণ ব্যতীত কোন নির্বাচন কমিশনার অপসারিত হইবেন না।',
                textAlign: TextAlign.justify,
              )),
              ListTile(
                  title: SelectableText(
                '(৬) কোন নির্বাচন কমিশনার রাষ্ট্রপতিকে উদ্দেশ করিয়া স্বাক্ষরযুক্ত পত্রযোগে স্বীয় পদ ত্যাগ করিতে পারিবেন।',
                textAlign: TextAlign.justify,
              )),
            ],
          ),
          ExpansionTile(
            title: Text('১১৯। নির্বাচন কমিশনের দায়িত্ব'),
            children: <Widget>[
              ListTile(
                  title: SelectableText(
                '১১৯। (১) রাষ্ট্রপতি পদের ও সংসদের নির্বাচনের জন্য ভোটার-তালিকা প্রস্তুতকরণের তত্ত্বাবধান, নির্দেশ ও নিয়ন্ত্রণ এবং অনুরূপ নির্বাচন পরিচালনার দায়িত্ব নির্বাচন কমিশনের উপর ন্যস্ত থাকিবে এবং নির্বাচন কমিশন এই সংবিধান ও আইনানুযায়ী \n(ক) রাষ্ট্রপতি পদের নির্বাচন অনুষ্ঠান করিবেন; \n(খ) সংসদ-সদস্যদের নির্বাচন অনুষ্ঠান করিবেন; \n(গ) সংসদে নির্বাচনের জন্য নির্বাচনী এলাকার সীমানা নির্ধারণ করিবেন; এবং \n(ঘ) রাষ্ট্রপতির পদের এবং সংসদের নির্বাচনের জন্য ভোটার-তালিকা প্রস্তুত করিবেন।',
                textAlign: TextAlign.justify,
              )),
              ListTile(
                  title: SelectableText(
                '(২) উপরি-উক্ত দফাসমূহে নির্ধারিত দায়িত্বসমূহের অতিরিক্ত যেরূপ দায়িত্ব এই সংবিধান বা অন্য কোন আইনের দ্বারা নির্ধারিত হইবে, নির্বাচন কমিশন সেইরূপ দায়িত্ব পালন করিবেন।',
                textAlign: TextAlign.justify,
              )),
            ],
          ),
          ExpansionTile(
            title: Text('১২০। নির্বাচন কমিশনের কর্মচারীগণ'),
            children: <Widget>[
              ListTile(
                  title: SelectableText(
                '১২০। এই ভাগের অধীন নির্বাচন কমিশনের উপর ন্যস্ত দায়িত্ব পালনের জন্য যেরূপ কর্মচারীর প্রয়োজন হইবে, নির্বাচন কমিশন অনুরোধ করিলে রাষ্ট্রপতি নির্বাচন কমিশনকে সেইরূপ কর্মচারী প্রদানের ব্যবস্থা করিবেন।',
                textAlign: TextAlign.justify,
              )),
            ],
          ),
          ExpansionTile(
            title: Text('১২১। প্রতি এলাকার জন্য একটিমাত্র ভোটার তালিকা'),
            children: <Widget>[
              ListTile(
                  title: SelectableText(
                '১২১। সংসদের নির্বাচনের জন্য প্রত্যেক আঞ্চলিক নির্বাচনী এলাকার একটি করিয়া ভোটার-তালিকা থাকিবে এবং ধর্ম, জাত, বর্ণ ও নারী-পুরুষভেদের ভিত্তিতে ভোটারদের বিন্যস্ত করিয়া কোন বিশেষ ভোটার-তালিকা প্রণয়ন করা যাইবে না।',
                textAlign: TextAlign.justify,
              )),
            ],
          ),
          ExpansionTile(
            title: Text('১২২। ভোটার-তালিকায় নামভুক্তির যোগ্যতা'),
            children: <Widget>[
              ListTile(
                  title: SelectableText(
                '১২২। (১) প্রাপ্ত বয়স্কের ভোটাধিকার-ভিত্তিতে সংসদের নির্বাচন অনুষ্ঠিত হইবে।',
                textAlign: TextAlign.justify,
              )),
              ListTile(
                  title: SelectableText(
                '(২) কোন ব্যক্তি সংসদের নির্বাচনের জন্য নির্ধারিত কোন নির্বাচনী এলাকায় ভোটার-তালিকাভু্ক্ত হইবার অধিকারী হইবেন, যদি \n(ক) তিনি বাংলাদেশের নাগরিক হন; \n(খ) তাঁহার বয়স আঠার বৎসরের কম না হয়; \n(গ) কোন যোগ্য আদালত কর্তৃক তাঁহার সম্পর্কে অপ্রকৃতিস্থ বলিয়া ঘোষণা বহাল না থাকিয়া থাকে; \nঘ) তিনি ঐ নির্বাচনী এলাকার অধিবাসী বা আইনের দ্বারা ঐ নির্বাচনী এলাকার অধিবাসী বিবেচিত হন; এবং \n(ঙ) তিনি ১৯৭২ সালের বাংলাদেশ যোগসাজশকারী (বিশেষ ট্রাইব্যুনাল) আদেশের অধীন কোন অপরাধের জন্য দণ্ডিত না হইয়া থাকেন।',
                textAlign: TextAlign.justify,
              )),
            ],
          ),
          ExpansionTile(
            title: Text('১২৩। নির্বাচন-অনুষ্ঠানের সময়'),
            children: <Widget>[
              ListTile(
                  title: SelectableText(
                '১২৩। (১) রাষ্ট্রপতি-পদের মেয়াদ অবসানের কারণে উক্ত পদ শূন্য হইলে মেয়াদ-সমাপ্তির তারিখের পূর্ববর্তী নব্বই হইতে ষাট দিনের মধ্যে শূন্য পদ পূরণের জন্য নির্বাচন অনুষ্ঠিত হইবে: \nতবে শর্ত থাকে যে, যে সংসদের দ্বারা তিনি নির্বাচিত হইয়াছেন সেই সংসদের মেয়াদকালে রাষ্ট্রপতির কার্যকাল শেষ হইলে সংসদের পরবর্তী সাধারণ নির্বাচন না হওয়া পর্যন্ত অনুরূপ শন্য পদ পূর্ণ করিবার জন্য নির্বাচন অনুষ্ঠিত হইবে না, এবং অনুরূপ সাধারণ নির্বাচনের পর সংসদের প্রথম বৈঠকের দিন হইতে ত্রিশ দিনের মধ্যে রাষ্ট্রপতির শূন্য পদ পূর্ণ করিবার জন্য নির্বাচন অনুষ্ঠিত হইবে।',
                textAlign: TextAlign.justify,
              )),
              ListTile(
                  title: SelectableText(
                '(২) মৃত্যু, পদত্যাগ বা অপসারণের ফলে রাষ্ট্রপতির পদ শূন্য হইলে পদটি শূন্য হইবার পর নব্বই দিনের মধ্যে, তাহা পূর্ণ করিবার জন্য নির্বাচন অনুষ্ঠিত হইবে।',
                textAlign: TextAlign.justify,
              )),
              ListTile(
                  title: SelectableText(
                '(৩) সংসদ-সদস্যদের সাধারণ নির্বাচন অনুষ্ঠিত হইবে \n(ক) মেয়াদ-অবসানের কারণে সংসদ ভাংগিয়া যাইবার ক্ষেত্রে ভাংগিয়া যাইবার পূর্ববর্তী নববই দিনের মধ্যে; এবং \n(খ) মেয়াদ-অবসান ব্যতীত অন্য কোন কারণে সংসদ ভাংগিয়া যাইবার ক্ষেত্রে ভাংগিয়া যাইবার পরবর্তী নববই দিনের মধ্যে: \nতবে শর্ত থাকে যে, এই দফার (ক) উপ-দফা অনুযায়ী অনুষ্ঠিত সাধারণ নির্বাচনে নির্বাচিত ব্যক্তিগণ, উক্ত উপ-দফায় উল্লিখিত মেয়াদ সমাপ্ত না হওয়া পর্যন্ত, সংসদ সদস্যরুপে কার্যভার গ্রহণ করিবেন না।',
                textAlign: TextAlign.justify,
              )),
              ListTile(
                  title: SelectableText(
                '(৪) সংসদ ভাঙ্গিয়া যাওয়া ব্যতীত অন্য কোন কারণে সংসদের কোন সদস্যপদ শূন্য হইলে পদটি শূন্য হইবার নব্বই দিনের মধ্যে উক্ত শূন্যপদ পূর্ণ করিবার জন্য নির্বাচন অনুষ্ঠিত হইবে \nতবে শর্ত থাকে যে, যদি প্রধান নির্বাচন কমিশনারের মতে, কোন দৈব-দূর্বিপাকের কারণে এই দফার নির্ধারিত মেয়াদের মধ্যে উক্ত নির্বাচন অনুষ্ঠান সম্ভব না হয়, তাহা হইলে উক্ত মেয়াদের শেষ দিনের পরবর্তী নব্বই দিনের মধ্যে উক্ত নির্বাচন অনুষ্ঠিত হইবে।',
                textAlign: TextAlign.justify,
              )),
            ],
          ),
          ExpansionTile(
            title: Text('১২৪। নির্বাচন সম্পর্কে সংসদের বিধান প্রণয়নের ক্ষমতা'),
            children: <Widget>[
              ListTile(
                  title: SelectableText(
                '১২৪। এই সংবিধানের বিধানাবলী সাপেক্ষে সংসদ আইনের দ্বারা নির্বাচনী এলাকার সীমা নির্ধারণ, ভোটার-তালিকা প্রস্তুতকরণ, নির্বাচন অনুষ্ঠান এবং সংসদের যথাযথ গঠনের জন্য প্রয়োজনীয় অন্যান্য বিষয়সহ সংসদের নির্বাচন সংক্রান্ত বা নির্বাচনের সহিত সম্পর্কিত সকল বিষয়ে বিধান প্রণয়ন করিতে পারিবেন।',
                textAlign: TextAlign.justify,
              )),
            ],
          ),
          ExpansionTile(
            title: Text('১২৫। নির্বাচনী আইন ও নির্বাচনের বৈধতা'),
            children: <Widget>[
              ListTile(
                  title: SelectableText(
                '১২৫। এই সংবিধানে যাহা বলা হইয়াছে, তাহা সত্ত্বেও \n(ক) এই সংবিধানের ১২৪ অনুচ্ছেদের অধীন প্রণীত বা প্রণীত বলিয়া বিবেচিত নির্বাচনী এলাকার সীমা নির্ধারণ, কিংবা অনুরূপ নির্বাচনী এলাকার জন্য আসন-বন্টন সম্পর্কিত যে কোন আইনের বৈধতা সম্পর্কে আদালতে প্রশ্ন উত্থাপন করা যাইবে না; \n(খ) সংসদ কর্তৃক প্রণীত কোন আইনের দ্বারা বা অধীন বিধান-অনুযায়ী কর্তৃপক্ষের নিকট এবং অনুরূপভাবে নির্ধারিত প্রণালীতে নির্বাচনী দরখাস্ত ব্যতীত রাষ্ট্রপতি পদে নির্বাচন বা সংসদের কোন নির্বাচন সম্পর্কে কোন প্রশ্ন উত্থাপন করা যাইবে না। \n(গ) কোন আদালত, নির্বাচনের তফসিল ঘোষণা করা হইয়াছে এইরুপ কোন নির্বাচনের বিষয়ে, নির্বাচন কমিশনকে যুক্তিসংগত নোটিশ ও শুনানির সুযোগ প্রদান না করিয়া, অন্তর্বর্তী বা অন্য কোনরুপে কোন আদেশ বা নির্দেশ প্রদান করিবেন না।',
                textAlign: TextAlign.justify,
              )),
            ],
          ),
          ExpansionTile(
            title:
                Text('১২৬। নির্বাচন কমিশনকে নির্বাহী কর্তৃপক্ষের সহায়তাদান'),
            children: <Widget>[
              ListTile(
                  title: SelectableText(
                '১২৫। এই সংবিধানে যাহা বলা হইয়াছে, তাহা সত্ত্বেও \n(ক) এই সংবিধানের ১২৪ অনুচ্ছেদের অধীন প্রণীত বা প্রণীত বলিয়া বিবেচিত নির্বাচনী এলাকার সীমা নির্ধারণ, কিংবা অনুরূপ নির্বাচনী এলাকার জন্য আসন-বন্টন সম্পর্কিত যে কোন আইনের বৈধতা সম্পর্কে আদালতে প্রশ্ন উত্থাপন করা যাইবে না; \n(খ) সংসদ কর্তৃক প্রণীত কোন আইনের দ্বারা বা অধীন বিধান-অনুযায়ী কর্তৃপক্ষের নিকট এবং অনুরূপভাবে নির্ধারিত প্রণালীতে নির্বাচনী দরখাস্ত ব্যতীত রাষ্ট্রপতি পদে নির্বাচন বা সংসদের কোন নির্বাচন সম্পর্কে কোন প্রশ্ন উত্থাপন করা যাইবে না। \n(গ) কোন আদালত, নির্বাচনের তফসিল ঘোষণা করা হইয়াছে এইরুপ কোন নির্বাচনের বিষয়ে, নির্বাচন কমিশনকে যুক্তিসংগত নোটিশ ও শুনানির সুযোগ প্রদান না করিয়া, অন্তর্বর্তী বা অন্য কোনরুপে কোন আদেশ বা নির্দেশ প্রদান করিবেন না।',
                textAlign: TextAlign.justify,
              )),
            ],
          ),
          Padding(
            padding: EdgeInsets.all(15),
            child: Column(children: <Widget>[
              Text(
                " \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n",
                style:
                    TextStyle(color: Colors.black87, fontSize: 15, height: 1.5),
                textAlign: TextAlign.justify,
              ),
              SizedBox(
                height: 10,
              ),
            ]),
          ),
        ],
      ),
    );
  }
}
