import 'package:flutter/material.dart';
import '../../globals.dart';

class PartSix extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text("ষষ্ঠ ভাগঃ বিচারবিভাগ"),
        // automaticallyImplyLeading: false,
        // actions: <Widget>[
        //   IconButton(
        //     icon: Icon(Icons.check),
        //     onPressed: () async{
        //       Navigator.pop(context);
        //     },
        //     tooltip: "Ok",
        //   ),
        // ],
        flexibleSpace: appBarStyle(),
      ),
      body: ListView(
        children: <Widget>[
          SizedBox(
            height: 10,
          ),
          Text(
            "(ষষ্ঠ ভাগ) বিচারবিভাগ",
            style: TextStyle(color: Colors.green[800], fontSize: 18),
            textAlign: TextAlign.center,
          ),
          SizedBox(
            height: 3,
          ),
          Divider(),
          SizedBox(
            height: 3,
          ),
          Text(
            "১ম পরিচ্ছেদঃ সুপ্রীম কোর্ট",
            style: TextStyle(color: Colors.green[900], fontSize: 16),
            textAlign: TextAlign.center,
          ),
          Divider(),
          ExpansionTile(
            title: Text('৯৪। সুপ্রীম কোর্ট প্রতিষ্ঠা'),
            children: <Widget>[
              ListTile(
                  title: Text(
                '৯৪। (১) "বাংলাদেশ সুপ্রীম কোর্ট" নামে বাংলাদেশের একটি সর্বোচ্চ আদালত থাকিবে এবং আপীল বিভাগ ও হাইকোর্ট বিভাগ লইয়া তাহা গঠিত হইবে।',
                textAlign: TextAlign.justify,
              )),
              ListTile(
                  title: Text(
                '(২) প্রধান বিচারপতি (যিনি "বাংলাদেশের প্রধান বিচারপতি" নামে অভিহিত হইবেন) এবং প্রত্যেক বিভাগে আসন গ্রহণের জন্য রাষ্ট্রপতি যেরূপ সংখ্যক বিচারক নিয়োগের প্রয়োজন বোধ করিবেন, সেইরূপ সংখ্যক অন্যান্য বিচারক লইয়া সুপ্রীম কোর্ট গঠিত হইবে।',
                textAlign: TextAlign.justify,
              )),
              ListTile(
                  title: Text(
                '(৩) প্রধান বিচারপতি ও আপীল বিভাগে নিযুক্ত বিচারকগণ কেবল উক্ত বিভাগে এবং অন্যান্য বিচারক কেবল হাইকোর্ট বিভাগে আসন গ্রহণ করিবেন।',
                textAlign: TextAlign.justify,
              )),
              ListTile(
                  title: Text(
                '(৪) এই সংবিধানের বিধানাবলী-সাপেক্ষে প্রধান বিচারপতি এবং অন্যান্য বিচারক বিচারকার্য পালনের ক্ষেত্রে স্বাধীন থাকিবেন।',
                textAlign: TextAlign.justify,
              )),
            ],
          ),
          ExpansionTile(
            title: Text('৯৫। বিচারক-নিয়োগ'),
            children: <Widget>[
              ListTile(
                  title: Text(
                '৯৫। (১) প্রধান বিচারপতি রাষ্ট্রপতি কর্তৃক নিযুক্ত হইবেন এবং প্রধান বিচারপতির সহিত পরামর্শ করিয়া রাষ্ট্রপতি অন্যান্য বিচারককে নিয়োগদান করিবেন।',
                textAlign: TextAlign.justify,
              )),
              ListTile(
                  title: Text(
                '(২) কোন ব্যক্তি বাংলাদেশের নাগরিক না হইলে, এবং (ক) সুপ্রীম কোর্টে অন্যূন দশ বৎসরকাল এ্যাডভোকেট না থাকিয়া থাকিলে; অথবা (খ) বাংলাদেশের রাষ্ট্রীয় সীমানার মধ্যে অন্যূন দশ বৎসর কোন বিচার বিভাগীয় পদে অধিষ্ঠান না করিয়া থাকিলে; অথবা (গ) সুপ্রীমকোর্টের বিচারক পদে নিয়োগলাভের জন্য আইনের দ্বারা নির্ধারিত যোগ্যতা না থাকিয়া থাকিলে ; তিনি বিচারকপদে নিয়োগ লাভের যোগ্য হইবেন না।',
                textAlign: TextAlign.justify,
              )),
              ListTile(
                  title: Text(
                '(৩) এই অনুচ্ছেদে ‘‘সুপ্রীম কোর্ট’’ বলিতে এই সংবিধান প্রবর্তনের পূর্বে যে কোন সময়ে বাংলাদেশের রাষ্ট্রীয় সীমানার মধ্যে যে আদালত হাইকোর্ট হিসাবে এখতিয়ার প্রয়োগ করিয়াছে, সেই আদালত অন্তর্ভুক্ত হইবে।',
                textAlign: TextAlign.justify,
              )),
            ],
          ),
          ExpansionTile(
            title: Text('৯৬। বিচারকের পদের মেয়াদ'),
            children: <Widget>[
              ListTile(
                  title: Text(
                '৯৬। (১) এই অনুচ্ছেদের অন্যান্য বিধানাবলী সাপেক্ষে কোন বিচারক সাতষট্টি বৎসর বয়স পূর্ণ হওয়া পর্যন্ত স্বীয় পদে বহাল থাকিবেন।',
                textAlign: TextAlign.justify,
              )),
              ListTile(
                  title: Text(
                '(২) প্রমাণিত অসদাচরণ বা অসামর্থ্যের কারণে সংসদের মোট সদস্য-সংখ্যার অন্যূন দুই-তৃতীয়াংশ গরিষ্ঠতার দ্বারা সমর্থিত সংসদের প্রস্তাবক্রমে প্রদত্ত রাষ্ট্রপতির আদেশ ব্যতীত কোন বিচারককে অপসারিত করা যাইবে না।',
                textAlign: TextAlign.justify,
              )),
              ListTile(
                  title: Text(
                '(৩) এই অনুচ্ছেদের (২) দফার অধীন প্রস্তাব সম্পর্কিত পদ্ধতি এবং কোন বিচারকের অসদাচরণ বা অসামর্থ্য সম্পর্কে তদন্ত ও প্রমাণের পদ্ধতি সংসদ আইনের দ্বারা নিয়ন্ত্রণ করিতে পারিবেন।',
                textAlign: TextAlign.justify,
              )),
              ListTile(
                  title: Text(
                '(৪) কোন বিচারক রাষ্ট্রপতিকে উদ্দেশ করিয়া স্বাক্ষরযুক্ত পত্রযোগে স্বীয় পদ ত্যাগ করিতে পারিবেন।',
                textAlign: TextAlign.justify,
              )),
            ],
          ),
          ExpansionTile(
            title: Text('৯৭। অস্থায়ী প্রধান বিচারপতি নিয়োগ'),
            children: <Widget>[
              ListTile(
                  title: Text(
                '৯৭। প্রধান বিচারপতির পদ শূন্য হইলে কিংবা অনুপস্থিতি, অসুস্থতা বা অন্য কোন কারণে প্রধান বিচারপতি তাঁহার দায়িত্বপালনে অসমর্থ বলিয়া রাষ্ট্রপতির নিকট সন্তোষজনকভাবে প্রতীয়মান হইলে ক্ষেত্রমত অন্য কোন ব্যক্তি অনুরূপ পদে যোগদান না করা পর্যন্ত কিংবা প্রধান বিচারপতি স্বীয় কার্যভার পুনরায় গ্রহণ না করা পর্যন্ত আপীল বিভাগের অন্যান্য বিচারকের মধ্যে যিনি কর্মে প্রবীণতম, তিনি অনুরূপ কার্যভার পালন করিবেন।',
                textAlign: TextAlign.justify,
              )),
            ],
          ),
          ExpansionTile(
            title: Text('৯৮। সুপ্রীম কোর্টের অতিরিক্ত বিচারকগণ'),
            children: <Widget>[
              ListTile(
                  title: Text(
                '৯৮। সংবিধানের ৯৪ অনুচ্ছেদের বিধানাবলী সত্ত্বেও রাষ্ট্রপতির নিকট সুপ্রীম কোর্টের কোন বিভাগের বিচারক-সংখ্যা সাময়িকভাবে বৃদ্ধি করা উচিত বলিয়া সন্তোষজনকভাবে প্রতীয়মান হইলে তিনি যথাযথ যোগ্যতাসম্পন্ন এক বা একাধিক ব্যক্তিকে অনধিক দুই বৎসরের জন্য অতিরিক্ত বিচারক নিযুক্ত করিতে পারিবেন, কিংবা তিনি উপযুক্ত বিবেচনা করিলে হাইকোর্ট বিভাগের কোন বিচারককে যে কোন অস্থায়ী মেয়াদের জন্য আপীল বিভাগের আসন গ্রহণের ব্যবস্থা করিতে পারিবেন: \nতবে শর্ত থাকে যে, অতিরিক্ত বিচারকরূপে নিযুক্ত (কোন ব্যক্তিকে এই সংবিধানের ৯৫ অনুচ্ছেদের অধীন বিচারকরূপে নিযুক্ত) হইতে কিংবা বর্তমান অনুচ্ছেদের অধীন আরও এক মেয়াদের জন্য অতিরিক্ত বিচারকরূপে নিযুক্ত হইতে বর্তমান অনুচ্ছেদের কোন কিছুই নিবৃত্ত করিবে না।',
                textAlign: TextAlign.justify,
              )),
            ],
          ),
          ExpansionTile(
            title: Text('৯৯। অবসর গ্রহণের পর বিচারগণের অক্ষমতা'),
            children: <Widget>[
              ListTile(
                  title: Text(
                '৯৯। (১) কোন ব্যক্তি (এই সংবিধানের ৯৮ অনুচ্ছেদের বিধানাবলী-অনুসারে অতিরিক্ত বিচারকরুপে দায়িত্ব পালন ব্যতীত) বিচারকরুপে দায়িত্ব পালন করিয়া থাকিলে উক্ত পদ হইতে অবসর গ্রহণের বা অপসারিত হইবার পর তিনি কোন আদালত বা কোন কর্তৃপক্ষের নিকট ওকালতি বা কার্য করিবেন না এবং বিচার বিভাগীয় বা আধা-বিচার বিভাগীয় পদ ব্যতীত প্রজাতন্ত্রের কর্মে কোন লাভজনক পদে নিয়োগ লাভের যোগ্য হইবেন না।',
                textAlign: TextAlign.justify,
              )),
              ListTile(
                  title: Text(
                '(২) (১) দফায় যাহা কিছুই থাকুক না কেন, কোন ব্যক্তি হাইকোর্ট বিভাগের বিচারক পদে বহাল থাকিলে উক্ত পদ হইতে অবসর গ্রহণের পর তিনি আপীল বিভাগে ওকালতি বা কার্য করিতে পারিবেন।',
                textAlign: TextAlign.justify,
              )),
            ],
          ),
          ExpansionTile(
            title: Text('১০০। সুপ্রীম কোর্টের আসন'),
            children: <Widget>[
              ListTile(
                  title: Text(
                '১০০। রাজধানীতে সুপ্রীম কোর্টের স্থায়ী আসন থাকিবে, তবে রাষ্ট্রপতির অনুমোদন লইয়া প্রধান বিচারপতি সময়ে সময়ে অন্য যে স্থান বা স্থানসমূহ নির্ধারণ করিবেন, সেই স্থান বা স্থানসমূহে হাইকোর্ট বিভাগের অধিবেশন অনুষ্ঠিত হইতে পারিবে।',
                textAlign: TextAlign.justify,
              )),
            ],
          ),
          ExpansionTile(
            title: Text('১০১। হাইকোর্ট বিভাগের এখতিয়ার'),
            children: <Widget>[
              ListTile(
                  title: Text(
                '১০১। এই সংবিধান বা অন্য কোন আইনের দ্বারা হাইকোর্ট বিভাগের উপর যেরুপ আদি, আপীল ও অন্য প্রকার এখতিয়ার ও ক্ষমতা অর্পিত হইয়াছে, উক্ত বিভাগের সেইরুপ এখতিয়ার ও ক্ষমতা থাকিবে।',
                textAlign: TextAlign.justify,
              )),
            ],
          ),
          ExpansionTile(
            title: Text(
                '১০২। কতিপয় আদেশ ও নির্দেশ প্রভৃতি দানের ক্ষেত্রে হাইকোর্ট বিভাগের ক্ষমতা'),
            children: <Widget>[
              ListTile(
                  title: Text(
                '১০২।(১) কোন সংক্ষুব্ধ ব্যক্তির আবেদনক্রমে এই সংবিধানের তৃতীয় ভাগের দ্বারা অর্পিত অধিকারসমূহের যে কোন একটি বলবৎ করিবার জন্য প্রজাতন্ত্রের বিষয়াবলীর সহিত সম্পর্কিত কোন দায়িত্ব পালনকারী ব্যক্তিসহ যে কোন ব্যক্তি বা কর্তৃপক্ষকে হাইকোর্ট বিভাগ উপযুক্ত নির্দেশাবলী বা আদেশাবলী দান করিতে পারিবেন।',
                textAlign: TextAlign.justify,
              )),
              ListTile(
                  title: Text(
                '(২) হাইকোর্ট বিভাগের নিকট যদি সন্তোষজনকভাবে প্রতীয়মান হয় যে, আইনের দ্বারা অন্য কোন সমফলপ্রদ বিধান করা হয় নাই, তাহা হইলে \n(ক) যে কোন সংক্ষুব্ধ ব্যক্তির আবেদনক্রমে- \n(অ) প্রজাতন্ত্র বা কোন স্থানীয় কর্তৃপক্ষের বিষয়াবলীর সহিত সংশ্লিষ্ট যে কোন দায়িত্ব পালনে রত ব্যক্তিকে আইনের দ্বারা অনুমোদিত নয়, এমন কোন কার্য করা হইতে বিরত রাখিবার জন্য কিংবা আইনের দ্বারা তাঁহার করণীয় কার্য করিবার জন্য নির্দেশ প্রদান করিয়া, অথবা \n(আ) প্রজাতন্ত্র বা কোন স্থানীয় কর্তৃপক্ষের বিষয়াবলীর সহিত সংশ্লিষ্ট যে কোন দায়িত্ব পালনে রত ব্যক্তির কৃত কোন কার্য বা গৃহীত কোন কার্যধারা আইনসংগত কর্তৃত্ব ব্যতিরেকে করা হইয়াছে বা গৃহীত হইয়াছে ও তাঁহার কোন আইনগত কার্যকরতা নাই বলিয়া ঘোষণা করিয়া উক্ত বিভাগ আদেশদান করিতে পারিবেন; অথবা \n(খ) যে কোন ব্যক্তির আবেদনক্রমে- \n(অ) আইনসংগত কর্তৃত্ব ব্যতিরেকে বা বেআইনী উপায়ে কোন ব্যক্তিকে প্রহরায় আটক রাখা হয় নাই বলিয়া যাহাতে উক্ত বিভাগের নিকট সন্তোষজনকভাবে প্রতীয়মান হইতে পারে, সেইজন্য প্রহরায় আটক উক্ত ব্যক্তিকে উক্ত বিভাগের সম্মুখে আনয়নের নির্দেশ প্রদান করিয়া, অথবা \n(আ) কোন সরকারি পদে আসীন বা আসীন বলিয়া বিবেচিত কোন ব্যক্তিকে তিনি কোন্ কর্তৃত্ববলে অনুরূপ পদমর্যাদায় অধিষ্ঠানের দাবী করিতেছেন, তাহা প্রদর্শনের নির্দেশ প্রদান করিয়া উক্ত বিভাগ আদেশদান করিতে পারিবেন।',
                textAlign: TextAlign.justify,
              )),
              ListTile(
                  title: Text(
                '(৩) উপরি-উক্ত দফাসমূহে যাহা বলা হইয়াছে, তাহা সত্ত্বেও এই সংবিধানের ৪৭ অনুচেছদ প্রযোজ্য হয়, এইরুপ কোন আইনের ক্ষেত্রে বর্তমান অনুচ্ছেদের অধীন অন্তর্বর্তীকালীন বা অন্য কোন আদেশ দানের ক্ষমতা হাইকোর্ট বিভাগের থাকিবে না।',
                textAlign: TextAlign.justify,
              )),
              ListTile(
                  title: Text(
                '(৪) এই অনুচ্ছেদের (১) দফা কিংবা এই অনুচ্ছেদের (২) দফার (ক) উপ-দফার অধীন কোন আবেদনক্রমে যে ক্ষেত্রে অন্তর্বর্তী আদেশ প্রার্থনা করা হইয়াছে এবং অনুরুপ অর্ন্তবর্তী আদেশ \n(ক) যেখানে উন্নয়ন কর্মসূচী বাস্তবায়নের জন্য কোন ব্যবস্থা কিংবা কোন উন্নয়নমূলক কার্যের প্রতিকূলতা বা বাধা সৃষ্টি করিতে পারে; অথবা \n(খ) যেখানে অন্য কোনভাবে জনস্বার্থের পক্ষে ক্ষতিকর হইতে পারে সেইখানে অ্যাটর্নি-জেনারেলকে উক্ত আবেদন সম্পর্কে যুক্তিসঙ্গত নোটিশদান এবং অ্যাটর্নি-জেনারেলের (কিংবা এই বিষয়ে তাহার দ্বারা ভারপ্রাপ্ত অন্য কোন এ্যাডভোকেটের) বক্তব্য শ্রবণ না করা পর্যন্ত এবং এই দফার (ক) বা (খ) উপ-দফায় উল্লিখিত প্রতিক্রিয়া সৃষ্টি করিবে না বলিয়া হাইকোর্ট বিভাগের নিকট সন্তোষজনকভাবে প্রতীয়মান না হওয়া পর্যন্ত উক্ত বিভাগ কোন অন্তর্বর্তী আদেশদান করিবেন না।',
                textAlign: TextAlign.justify,
              )),
              ListTile(
                  title: Text(
                '(৫) প্রসংগের প্রয়োজনে অন্যরূপ না হইলে এই অনুচ্ছেদে ‘‘ব্যক্তি’’ বলিতে সংবিধিবদ্ধ সরকারী কর্তৃপক্ষ ও বাংলাদেশের প্রতিরক্ষা কর্মবিভাগসমূহ অথবা কোন শৃংখলা-বাহিনী সংক্রান্ত আইনের অধীন প্রতিষ্ঠিত কোন আদালত বা ট্রাইব্যুনাল ব্যতীত কিংবা এই সংবিধানের ১১৭ অনুচ্ছেদ প্রযোজ্য হয়, এইরুপ কোন ট্রাইব্যুনাল ব্যতীত যে কোন আদালত বা ট্রাইব্যুনাল অন্তর্ভুক্ত হইবে।',
                textAlign: TextAlign.justify,
              )),
            ],
          ),
          ExpansionTile(
            title: Text('১০৩। আপীল বিভাগের এখতিয়ার'),
            children: <Widget>[
              ListTile(
                  title: Text(
                '১০৩। (১) হাইকোর্ট বিভাগের রায়, ডিক্রী, আদেশ বা দণ্ডাদেশের বিরুদ্ধে আপীল শুনানীর ও তাহা নিষ্পত্তির এখতিয়ার আপীল বিভাগের থাকিবে।',
                textAlign: TextAlign.justify,
              )),
              ListTile(
                  title: Text(
                '(২) হাইকোর্ট বিভাগের রায়, ডিক্রী, আদেশ বা দণ্ডাদেশের বিরুদ্ধে আপীল বিভাগের নিকট সেই ক্ষেত্রে অধিকারবলে আপীল করা যাইবে, যে ক্ষেত্রে হাইকোর্ট বিভাগ \n(ক) এই মর্মে সার্টিফিকেট দান করিবেন যে, মামলাটির সহিত এই সংবিধান-ব্যাখ্যার বিষয়ে আইনের গুরুত্বপূর্ণ প্রশ্ন জড়িত রহিয়াছে; অথবা \n(খ) কোন মৃত্যুদণ্ড বহাল করিয়াছেন কিংবা কোন ব্যক্তিকে মৃত্যুদণ্ডে বা যাবজ্জীবন কারাদণ্ডে দণ্ডিত করিয়াছেন ; অথবা \n(গ) উক্ত বিভাগের অবমাননার জন্য কোন ব্যক্তিকে দণ্ডদান করিয়াছেন; \nএবং সংসদে আইন-দ্বারা যেরূপ বিধান করা হইবে, সেইরূপ অন্যান্য ক্ষেত্রে।',
                textAlign: TextAlign.justify,
              )),
            ],
          ),
          ExpansionTile(
            title: Text('১০৪। আপীল বিভাগের পরোয়ানা জারী ও নির্বাহ'),
            children: <Widget>[
              ListTile(
                  title: Text(
                '১০৪। কোন ব্যক্তির হাজিরা কিংবা কোন দলিলপত্র উদ্ঘাটন বা দাখিল করিবার আদেশসহ আপীল বিভাগের নিকট বিচারাধীন যে কোন মামলা বা বিষয়ে সম্পূর্ণ ন্যায়বিচারের জন্য যেরূপ প্রয়োজনীয় হইতে পারে, উক্ত বিভাগ সেইরূপ নির্দেশ, আদেশ, ডিক্রী বা রীট জারী করিতে পারিবেন।',
                textAlign: TextAlign.justify,
              )),
            ],
          ),
          ExpansionTile(
            title: Text('১০৫। আপীল বিভাগ কর্তৃক রায় বা আদেশ পুনর্বিবেচনা'),
            children: <Widget>[
              ListTile(
                  title: Text(
                '১০৫। সংসদের যে কোন আইনের বিধানাবলী-সাপেক্ষে এবং আপীল বিভাগ কর্তৃক প্রণীত যে কোন বিধি-সাপেক্ষে আপীল বিভাগের কোন ঘোষিত রায় বা প্রদত্ত আদেশ পুনর্বিবেচনার ক্ষমতা উক্ত বিভাগের থাকিবে।',
                textAlign: TextAlign.justify,
              )),
            ],
          ),
          ExpansionTile(
            title: Text('১০৬। সুপ্রীম কোর্টের উপদেষ্টামূলক এখতিয়ার'),
            children: <Widget>[
              ListTile(
                  title: Text(
                '১০৬। যদি কোন সময়ে রাষ্ট্রপতির নিকট প্রতীয়মান হয় যে, আইনের এইরূপ কোন প্রশ্ন উত্থাপিত হইয়াছে বা উত্থাপনের সম্ভাবনা দেখা দিয়াছে, যাহা এমন ধরণের ও এমন জন-গুরুত্বসম্পন্ন যে, সেই সম্পর্কে সুপ্রীম কোর্টের মতামত গ্রহণ করা প্রয়োজন, তাহা হইলে তিনি প্রশ্নটি আপীল বিভাগের বিবেচনার জন্য প্রেরণ করিতে পারিবেন এবং উক্ত বিভাগ স্বীয় বিবেচনায় উপযুক্ত শুনানীর পর প্রশ্নটি সম্পর্কে রাষ্ট্রপতিকে স্বীয় মতামত জ্ঞাপন করিতে পারিবেন।',
                textAlign: TextAlign.justify,
              )),
            ],
          ),
          ExpansionTile(
            title: Text('১০৭। সুপ্রীম কোর্টের বিধি-প্রণয়ন-ক্ষমতা'),
            children: <Widget>[
              ListTile(
                  title: Text(
                '১০৭। (১) সংসদ কর্তৃক প্রণীত যে কোন আইন-সাপেক্ষে সুপ্রীম কোর্ট রাষ্ট্রপতির অনুমোদন লইয়া প্রত্যেক বিভাগের এবং অধঃস্তন যে কোন আদালতের রীতি ও পদ্ধতি-নিয়ন্ত্রণের জন্য বিধিসমূহ প্রণয়ন করিতে পারিবেন।',
                textAlign: TextAlign.justify,
              )),
              ListTile(
                  title: Text(
                '(২) সুপ্রীম কোর্ট এই অনুচ্ছেদের (১) দফা এবং এই সংবিধানের ১১৩ ও ১১৬ অনুচ্ছেদের অধীন দায়িত্বসমূহের ভার উক্ত আদালতের কোন একটি বিভাগকে কিংবা এক বা একাধিক বিচারককে অর্পণ করিতে পারিবেন।',
                textAlign: TextAlign.justify,
              )),
              ListTile(
                  title: Text(
                '(৩) এই অনুচ্ছেদের অধীন প্রণীত বিধিসমূহ-সাপেক্ষে কোন্ কোন্ বিচারককে লইয়া কোন্ বিভাগের কোন্ বেঞ্চ গঠিত হইবে এবং কোন্ কোন্ বিচারক কোন্ উদ্দেশ্যে আসন গ্রহণ করিবেন, তাহা প্রধান বিচারপতি নির্ধারণ করিবেন।',
                textAlign: TextAlign.justify,
              )),
              ListTile(
                  title: Text(
                '(৪) প্রধান বিচারপতি সুপ্রীম কোর্টের যে কোন বিভাগের কর্মে প্রবীণতম বিচারককে সেই বিভাগে এই অনুচ্ছেদের (৩) দফা কিংবা এই অনুচ্ছেদের অধীন প্রণীত বিধিসমূহ-দ্বারা অর্পিত যে কোন ক্ষমতা প্রয়োগের ভার প্রদান করিতে পারিবেন।',
                textAlign: TextAlign.justify,
              )),
            ],
          ),
          ExpansionTile(
            title: Text('১০৮। "কোর্ট অব রেকর্ড" রূপে সুপ্রীম কোর্ট'),
            children: <Widget>[
              ListTile(
                  title: Text(
                '১০৮। সুপ্রীম কোর্ট একটি "কোর্ট অব্ রেকর্ড" হইবেন এবং ইহার অবমাননার জন্য তদন্তের আদেশদান বা দণ্ডাদেশদানের ক্ষমতাসহ আইন-সাপেক্ষে অনুরূপ আদালতের সকল ক্ষমতার অধিকারী থাকিবেন।',
                textAlign: TextAlign.justify,
              )),
            ],
          ),
          ExpansionTile(
            title: Text('১০৯। আদালতসমূহের উপর তত্ত্বাবধান ও নিয়ন্ত্রণ'),
            children: <Widget>[
              ListTile(
                  title: Text(
                '১০৯। হাইকোর্ট বিভাগের অধঃস্তন সকল আদালত ও ট্রাইব্যুনালের উপর উক্ত বিভাগের তত্ত্বাবধান ও নিয়ন্ত্রণ-ক্ষমতা থাকিবে।',
                textAlign: TextAlign.justify,
              )),
            ],
          ),
          ExpansionTile(
            title:
                Text('১১০। অধস্তন আদালত হইতে হাইকোর্ট বিভাগে মামলা স্থানান্তর'),
            children: <Widget>[
              ListTile(
                  title: Text(
                '১১০। হাইকোর্ট বিভাগের নিকট যদি সন্তোষজনকভাবে প্রতীয়মান হয় যে, উক্ত বিভাগের কোন অধঃস্তন আদালতের বিচারাধীন কোন মামলায় এই সংবিধানের ব্যাখ্যা-সংক্রান্ত আইনের এমন গুরুত্বপূর্ণ প্রশ্ন বা এমন জন-গুরুত্বসম্পন্ন বিষয় জড়িত রহিয়াছে, সংশ্লিষ্ট মামলার মীমাংসার জন্য যাহার সম্পর্কে সিদ্ধান্ত গ্রহণ প্রয়োজন, তাহা হইলে হাইকোর্ট বিভাগ উক্ত আদালত হইতে মামলাটি প্রত্যাহার করিয়া লইবেন এবং \n(ক) স্বয়ং মামলাটির মীমাংসা করিবেন; অথবা \n(খ) উক্ত আইনের প্রশ্নটির নিষ্পত্তি করিবেন এবং উক্ত প্রশ্ন সম্বন্ধে হাইকোর্ট বিভাগের রায়ের নকলসহ যে আদালত হইতে মামলাটি প্রত্যাহার করা হইয়াছিল, সেই আদালতে (বা অন্য কোন অধঃস্তন আদালতে) মামলাটি ফেরত পাঠাইবেন এবং তাহা প্রাপ্ত হইবার পর সেই আদালত উক্ত রায়ের সহিত সঙ্গতি রক্ষা করিয়া মামলাটির মীমাংসা করিতে প্রবৃত্ত হইবেন।',
                textAlign: TextAlign.justify,
              )),
            ],
          ),
          ExpansionTile(
            title: Text('১১১। সুপ্রীম কোর্টের রায়ের বাধ্যতামূলক কার্যকরতা'),
            children: <Widget>[
              ListTile(
                  title: Text(
                '১১১। আপীল বিভাগ কর্তৃক ঘোষিত আইন হাইকোর্ট বিভাগের জন্য এবং সুপ্রীম কোর্টের যে কোন বিভাগ কর্তৃক ঘোষিত আইন অধঃস্তন সকল আদালতের জন্য অবশ্যপালনীয় হইবে।',
                textAlign: TextAlign.justify,
              )),
            ],
          ),
          ExpansionTile(
            title: Text('১১২। সুপ্রীম কোর্টের সহায়তা'),
            children: <Widget>[
              ListTile(
                  title: Text(
                '১১২। প্রজাতন্ত্রের রাষ্ট্রীয় সীমানার অন্তর্ভুক্ত সকল নির্বাহী ও বিচার বিভাগীয় কর্তৃপক্ষ সুপ্রীম কোর্টের সহায়তা করিবেন।',
                textAlign: TextAlign.justify,
              )),
            ],
          ),
          ExpansionTile(
            title: Text('১১৩। সুপ্রীম কোর্টের কর্মচারীগণ'),
            children: <Widget>[
              ListTile(
                  title: Text(
                '১১৩। (১) প্রধান বিচারপতি কিংবা তাঁহার নির্দেশক্রমে অন্য কোন বিচারক বা কর্মচারী সুপ্রীম কোর্টের কর্মচারীদিগকে নিযুক্ত করিবেন এবং রাষ্ট্রপতির পূর্বানুমোদনক্রমে সুপ্রীম কোর্ট কর্তৃক প্রণীত বিধিসমূহ-অনুযায়ী এই নিয়োগদান করা হইবে।',
                textAlign: TextAlign.justify,
              )),
              ListTile(
                  title: Text(
                '(২) সংসদের যে কোন আইনের বিধানাবলী-সাপেক্ষে সুপ্রীম কোর্ট কর্তৃক প্রণীত বিধিসমূহে যেরূপ নির্ধারিত হইবে, সুপ্রীম কোর্টের কর্মচারীদের কর্মের শর্তাবলী সেইরূপ হইবে।',
                textAlign: TextAlign.justify,
              )),
            ],
          ),
          SizedBox(
            height: 3,
          ),
          Divider(),
          SizedBox(
            height: 3,
          ),
          Text(
            "২য় পরিচ্ছেদঃ অধস্তন আদালত",
            style: TextStyle(color: Colors.green[900], fontSize: 16),
            textAlign: TextAlign.center,
          ),
          Divider(),
          ExpansionTile(
            title: Text('১১৪। অধস্তন আদালত-সমূহ প্রতিষ্ঠা'),
            children: <Widget>[
              ListTile(
                  title: Text(
                '১১৪। আইনের দ্বারা যেরূপ প্রতিষ্ঠিত হইবে, সুপ্রীম কোর্ট ব্যতীত সেইরূপ অন্যান্য অধস্তন আদালত থাকিবে।',
                textAlign: TextAlign.justify,
              )),
            ],
          ),
          ExpansionTile(
            title: Text('১১৫। অধস্তন আদালতে নিয়োগ'),
            children: <Widget>[
              ListTile(
                  title: Text(
                '১১৫। বিচারবিভাগীয় পদে বা বিচার বিভাগীয় দায়িত্ব পালনকারী ম্যাজিষ্ট্রেট পদে রাষ্ট্রপতি কর্তৃক উক্ত উদেশ্যে প্রণীত বিধিসমূহ অনুযায়ী রাষ্ট্রপতি নিয়োগদান করিবেন।',
                textAlign: TextAlign.justify,
              )),
            ],
          ),
          ExpansionTile(
            title: Text('১১৬। অধস্তন আদালতসমূহের নিয়ন্ত্রণ ও শৃঙ্খলা'),
            children: <Widget>[
              ListTile(
                  title: Text(
                '১১৬। বিচার-কর্মবিভাগে নিযুক্ত ব্যক্তিদের এবং বিচারবিভাগীয় দায়িত্বপালনে রত ম্যাজিষ্ট্রেটদের নিয়ন্ত্রণ (কর্মস্থল- নির্ধারণ, পদোন্নতিদান ও ছুটি মঞ্জুরীসহ) ও শৃংখলাবিধান রাষ্ট্রপতির উপর ন্যস্ত থাকিবে এবং সুপ্রীম কোর্টের সহিত পরামর্শক্রমে রাষ্ট্রপতি কর্তৃক তাহা প্রযুক্ত হইবে।',
                textAlign: TextAlign.justify,
              )),
            ],
          ),
          ExpansionTile(
            title: Text(
                '১১৬ক। বিচারবিভাগীয় কর্মচারীগণ বিচারকার্য পালনের ক্ষেত্রে স্বাধীন'),
            children: <Widget>[
              ListTile(
                  title: Text(
                '১১৬ক। এই সংবিধানের বিধানাবলী সাপেক্ষে বিচার-কর্মবিভাগে নিযুক্ত ব্যক্তিগণ এবং ম্যাজিষ্ট্রেটগণ বিচারকার্য পালনের ক্ষেত্রে স্বাধীন থাকিবেন',
                textAlign: TextAlign.justify,
              )),
            ],
          ),
          SizedBox(
            height: 3,
          ),
          Divider(),
          SizedBox(
            height: 3,
          ),
          Text(
            "৩য় পরিচ্ছেদঃ প্রশাসনিক ট্রাইব্যুনাল",
            style: TextStyle(color: Colors.green[900], fontSize: 16),
            textAlign: TextAlign.center,
          ),
          Divider(),
          ExpansionTile(
            title: Text('১১৭। প্রশাসনিক ট্রাইব্যুনালসমূহ'),
            children: <Widget>[
              ListTile(
                  title: Text(
                '১১৭। (১) ইতঃপূর্বে যাহা বলা হইয়াছে, তাহা সত্ত্বেও নিম্নলিখিত ক্ষেত্রসমুহ সম্পর্কে বা ক্ষেত্রসমুহ হইতে উদ্ভূত বিষয়াদির উপর এখতিয়ার প্রয়োগের জন্য সংসদ আইনের দ্বারা এক বা একাধিক প্রশাসনিক ট্রাইব্যুনাল প্রতিষ্ঠিত করিতে পারিবেন- \n(ক) নবম ভাগে বর্ণিত বিষয়াদি এবং অর্থদণ্ড বা অন্য দণ্ডসহ প্রজাতন্ত্রের কর্মে নিযুক্ত ব্যক্তিদের কর্মের শর্তাবলী; \n(খ) যে কোন রাষ্ট্রায়ত্ত উদ্যোগ বা সংবিধিবদ্ধ সরকারী কর্তৃপক্ষের চালনা ও ব্যবস্থাপনা এবং অনুরূপ উদ্যোগ বা সংবিধিবদ্ধ সরকারী কর্তৃপক্ষে কর্মসহ কোন আইনের দ্বারা বা অধীন সরকারের উপর ন্যস্ত বা সরকারের দ্বারা পরিচালিত কোন সম্পত্তির অর্জন, প্রশাসন, ব্যবস্থাপনা ও বিলি-ব্যবস্থা; \n(গ) যে আইনের উপর এই সংবিধানের ১০২ অনুচ্ছেদের দফা প্রযোজ্য হয়, সেইরূপ কোন আইন।',
                textAlign: TextAlign.justify,
              )),
              ListTile(
                  title: Text(
                '(২) কোন ক্ষেত্রে এই অনুচ্ছেদের অধীন কোন প্রশাসনিক ট্রাইব্যুনাল প্রতিষ্ঠিত হইলে অনুরূপ ট্রাইব্যুনালের এখতিয়ারের অন্তর্গত কোন বিষয়ে অন্য কোন আদালত কোনরূপ কার্যধারা গ্রহণ করিবেন না বা কোন আদেশ প্রদান করিবেন না: \nতবে শর্ত থাকে যে, সংসদ আইনের দ্বারা কোন ট্রাইব্যুনালের সিদ্ধান্ত পুনর্বিবেচনা বা অনুরূপ সিদ্ধান্তের বিরুদ্ধে আপীলের বিধান করিতে পারিবেন।',
                textAlign: TextAlign.justify,
              )),
            ],
          ),
        ],
      ),
    );
  }
}
