import 'package:flutter/material.dart';
import '../../globals.dart';

class PartFour extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text("চতুর্থ ভাগঃ নির্বাহী বিভাগ"),
        // automaticallyImplyLeading: false,
        // actions: <Widget>[
        //   IconButton(
        //     icon: Icon(Icons.check),
        //     onPressed: () async{
        //       Navigator.pop(context);
        //     },
        //     tooltip: "Ok",
        //   ),
        // ],
        flexibleSpace: appBarStyle(),
      ),
      body: ListView(
        children: <Widget>[
          SizedBox(
            height: 10,
          ),
          Text(
            "(চতুর্থ ভাগ) নির্বাহী বিভাগ",
            style: TextStyle(color: Colors.green[800], fontSize: 18),
            textAlign: TextAlign.center,
          ),
          SizedBox(
            height: 3,
          ),
          Divider(),
          SizedBox(
            height: 3,
          ),
          Text(
            "১ম পরিচ্ছেদঃ রাষ্ট্রপতি",
            style: TextStyle(color: Colors.green[900], fontSize: 16),
            textAlign: TextAlign.center,
          ),
          Divider(),
          ExpansionTile(
            title: Text('৪৮। রাষ্ট্রপতি'),
            children: <Widget>[
              ListTile(
                  title: Text(
                '৪৮। (১) বাংলাদেশের একজন রাষ্ট্রপতি থাকিবেন, যিনি আইন অনুযায়ী সংসদ-সদস্যগণ কর্তৃক নির্বাচিত হইবেন।',
                textAlign: TextAlign.justify,
              )),
              ListTile(
                  title: Text(
                '(২) রাষ্ট্রপ্রধানরূপে রাষ্ট্রপতি রাষ্ট্রের অন্য সকল ব্যক্তির ঊর্ধ্বে স্থান লাভ করিবেন এবং এই সংবিধান ও অন্য কোন আইনের দ্বারা তাঁহাকে প্রদত্ত ও তাঁহার উপর অর্পিত সকল ক্ষমতা প্রয়োগ ও কর্তব্য পালন করিবেন।',
                textAlign: TextAlign.justify,
              )),
              ListTile(
                  title: Text(
                '(৩) এই সংবিধানের ৫৬ অনুচ্ছেদের (৩) দফা অনুসারে কেবল প্রধানমন্ত্রী ও ৯৫ অনুচ্ছেদের (১) দফা অনুসারে প্রধান বিচারপতি নিয়োগের ক্ষেত্র ব্যতীত রাষ্টপতি তাঁহার অন্য সকল দায়িত্ব পালনে প্রধানমন্ত্রীর পরামর্শ অনুযায়ী কার্য করিবেন:\nতবে শর্ত থাকে যে, প্রধানমন্ত্রী রাষ্ট্রপতিকে আদৌ কোন পরামর্শদান করিয়াছেন কি না এবং করিয়া থাকিলে কি পরামর্শ দান করিয়াছেন, কোন আদালত সেই সম্পর্কে কোন প্রশ্নের তদন্ত করিতে পারিবেন না।',
                textAlign: TextAlign.justify,
              )),
              ListTile(
                  title: Text(
                '(৪) কোন ব্যক্তি রাষ্ট্রপতি নির্বাচিত হইবার যোগ্য হইবেন না, যদি তিনি- \n(ক) পঁয়ত্রিশ বৎসরের কম বয়স্ক হন; অথবা \n(খ) সংসদ-সদস্য নির্বাচিত হইবার যোগ্য না হন; অথবা \n(গ) কখনও এই সংবিধানের অধীন অভিশংসন দ্বারা রাষ্ট্রপতির পদ হইতে অপসারিত হইয়া থাকেন।',
                textAlign: TextAlign.justify,
              )),
              ListTile(
                  title: Text(
                '(৫) প্রধানমন্ত্রী রাষ্ট্রীয় ও পররাষ্ট্রীয় নীতি সংক্রান্ত বিষয়াদি সম্পর্কে রাষ্ট্রপতিকে অবহিত রাখিবেন এবং রাষ্ট্রপতি অনুরোধ করিলে যে-কোন বিষয় মন্ত্রিসভায় বিবেচনার জন্য পেশ করিবেন।',
                textAlign: TextAlign.justify,
              )),
            ],
          ),
          ExpansionTile(
            title: Text('৪৯। ক্ষমা প্রদর্শনের অধিকার'),
            children: <Widget>[
              ListTile(
                  title: Text(
                '৪৯। কোন আদালত, ট্রাইব্যুনাল বা অন্য কোন কর্তৃপক্ষ কর্তৃক প্রদত্ত যে−কোন দণ্ডের মার্জনা, বিলম্বন ও বিরাম মঞ্জুর করিবার এবং যে−কোন দণ্ড মওকুফ, স্থগিত বা হ্রাস করিবার ক্ষমতা রাষ্ট্রপতির থাকিবে।',
                textAlign: TextAlign.justify,
              ))
            ],
          ),
          ExpansionTile(
            title: Text('৫০। রাষ্ট্রপতি-পদের মেয়াদ'),
            children: <Widget>[
              ListTile(
                  title: Text(
                '৫০। (১) এই সংবিধানের বিধানাবলী সাপেক্ষে রাষ্ট্রপতি কার্যভার গ্রহণের তারিখ হইতে পাঁচ বৎসরের মেয়াদে তাঁহার পদে অধিষ্ঠিত থাকিবেন:\nতবে শর্ত থাকে যে, রাষ্ট্রপতির পদের মেয়াদ শেষ হওয়া সত্ত্বেও তাঁহার উত্তরাধিকারী-কার্যভার গ্রহণ না করা পর্যন্ত তিনি স্বীয় পদে বহাল থাকিবেন।',
                textAlign: TextAlign.justify,
              )),
              ListTile(
                  title: Text(
                '(২) একাদিক্রমে হউক বা না হউক-দুই মেয়াদের অধিক রাষ্ট্রপতির পদে কোন ব্যক্তি অধিষ্ঠিত থাকিবেন না।',
                textAlign: TextAlign.justify,
              )),
              ListTile(
                  title: Text(
                '(৩) স্পীকারের উদ্দেশ্যে স্বাক্ষরযুক্ত পত্রযোগে রাষ্ট্রপতি স্বীয় পদ ত্যাগ করিতে পারিবেন।',
                textAlign: TextAlign.justify,
              )),
              ListTile(
                  title: Text(
                '(৪) রাষ্ট্রপতি তাঁহার কার্যভারকালে সংসদ-সদস্য নির্বাচিত হইবার যোগ্য হইবেন না, এবং কোন সংসদ-সদস্য রাষ্ট্রপতি নির্বাচিত হইলে রাষ্ট্রপতিরূপে তাঁহার কার্যভার গ্রহণের দিনে সংসদে তাঁহার আসন শূন্য হইবে।',
                textAlign: TextAlign.justify,
              )),
            ],
          ),
          ExpansionTile(
            title: Text('৫১। রাষ্ট্রপতির দায়মুক্তি'),
            children: <Widget>[
              ListTile(
                  title: Text(
                '৫১। (১) এই সংবিধানের ৫২ অনুচ্ছেদের হানি না ঘটাইয়া বিধান করা হইতেছে যে, রাষ্ট্রপতি তাঁহার দায়িত্ব পালন করিতে গিয়া কিংবা অনুরূপ বিবেচনায় কোন কার্য করিয়া থাকিলে বা না করিয়া থাকিলে সেইজন্য তাঁহাকে কোন আদালতে জবাবদিহি করিতে হইবে না, তবে এই দফা সরকারের বিরুদ্ধে কার্যধারা গ্রহণে কোন ব্যক্তির অধিকার ক্ষুণ্ন করিবে না।',
                textAlign: TextAlign.justify,
              )),
              ListTile(
                  title: Text(
                '(২) রাষ্ট্রপতির কার্যভারকালে তাঁহার বিরুদ্ধে কোন আদালতে কোন প্রকার ফৌজদারী কার্যধারা দায়ের করা বা চালু রাখা যাইবে না এবং তাঁহার গ্রেফতার বা কারাবাসের জন্য কোন আদালত হইতে পরোয়ানা জারী করা যাইবে না।',
                textAlign: TextAlign.justify,
              )),
            ],
          ),
          ExpansionTile(
            title: Text('৫২। রাষ্ট্রপতির অভিশংসন'),
            children: <Widget>[
              ListTile(
                  title: Text(
                '৫২। (১) এই সংবিধান লংঘন বা গুরুতর অসদাচরণের অভিযোগে রাষ্ট্রপতিকে অভিশংসিত করা যাইতে পারিবে; ইহার জন্য সংসদের মোট সদস্যের সংখ্যাগরিষ্ঠ অংশের স্বাক্ষরে অনুরূপ অভিযোগের বিবরণ লিপিবদ্ধ করিয়া একটি প্রস্তাবের নোটিশ স্পীকারের নিকট প্রদান করিতে হইবে; স্পীকারের নিকট অনুরূপ নোটিশ প্রদানের দিন হইতে চৌদ্দ দিনের পূর্বে বা ত্রিশ দিনের পর এই প্রস্তাব আলোচিত হইতে পারিবে না এবং সংসদ অধিবেশনরত না থাকিলে স্পীকার অবিলম্বে সংসদ আহবান করিবেন।',
                textAlign: TextAlign.justify,
              )),
              ListTile(
                  title: Text(
                '(২) এই অনুচ্ছেদের অধীন কোন অভিযোগ তদন্তের জন্য সংসদ কর্তৃক নিযুক্ত বা আখ্যায়িত কোন আদালত, ট্রাইব্যুনাল বা কর্তৃপক্ষের নিকট সংসদ রাষ্ট্রপতির আচরণ গোচর করিতে পারিবেন।',
                textAlign: TextAlign.justify,
              )),
              ListTile(
                  title: Text(
                '(৩) অভিযোগ বিবেচনাকালে রাষ্ট্রপতির উপস্থিত থাকিবার এবং প্রতিনিধি প্রেরণের অধিকার থাকিবে।',
                textAlign: TextAlign.justify,
              )),
              ListTile(
                  title: Text(
                '(৪) অভিযোগ বিবেচনার পর মোট সদস্য-সংখ্যার অন্যূন দুই-তৃতীয়াংশ ভোটে অভিযোগ যথার্থ বলিয়া ঘোষণা করিয়া সংসদ কোন প্রস্তাব গ্রহণ করিলে প্রস্তাব গৃহীত হইবার তারিখে রাষ্ট্রপতির পদ শূন্য হইবে।',
                textAlign: TextAlign.justify,
              )),
              ListTile(
                  title: Text(
                '(৫) এই সংবিধানের ৫৪ অনুচ্ছেদ অনুযায়ী স্পীকার কর্তৃক রাষ্ট্রপতির দায়িত্ব পালনকালে এই অনুচ্ছেদের বিধানাবলী এই পরিবর্তন সাপেক্ষে প্রযোজ্য হইবে যে, এই অনুচ্ছেদের (১) দফায় স্পীকারের উল্লেখ ডেপুটি স্পীকারের উল্লেখ বলিয়া গণ্য হইবে এবং (৪) দফায় রাষ্ট্রপতির পদ শূন্য হইবার উল্লেখ স্পীকারের পদ শূন্য হইবার উল্লেখ বলিয়া গণ্য হইবে; এবং (৪) দফায় বর্ণিত কোন প্রস্তাব গৃহীত হইলে স্পীকার রাষ্ট্রপতির দায়িত্ব পালনে বিরত হইবেন।',
                textAlign: TextAlign.justify,
              )),
            ],
          ),
          ExpansionTile(
            title: Text('৫৩। অসামর্থ্যের কারণে রাষ্ট্রপতির অপসারণ'),
            children: <Widget>[
              ListTile(
                  title: Text(
                '৫৩। (১) শারীরিক বা মানসিক অসামর্থ্যের কারণে রাষ্ট্রপতিকে তাঁহার পদ হইতে অপসারিত করা যাইতে পারিবে; ইহার জন্য সংসদের মোট সদস্যের সংখ্যাগরিষ্ঠ অংশের স্বাক্ষরে কথিত অসামর্থ্যের বিবরণ লিপিবদ্ধ করিয়া একটি প্রস্তাবের নোটিশ স্পীকারের নিকট প্রদান করিতে হইবে।',
                textAlign: TextAlign.justify,
              )),
              ListTile(
                  title: Text(
                '(২) সংসদ অধিবেশনরত না থাকিলে নোটিশ প্রাপ্তিমাত্র স্পীকার সংসদের অধিবেশন আহবান করিবেন এবং একটি চিকিৎসা-পর্ষদ (অতঃপর এই অনুচ্ছেদে "পর্ষদ" বলিয়া অভিহিত) গঠনের প্রস্তাব আহ্বান করিবেন এবং প্রয়োজনীয় প্রস্তাব উত্থাপিত ও গৃহীত হইবার পর স্পীকার তৎক্ষণাৎ উক্ত নোটিশের একটি প্রতিলিপি রাষ্ট্রপতির নিকট প্রেরণের ব্যবস্থা করিবেন এবং তাঁহার সহিত এই মর্মে স্বাক্ষরযুক্ত অনুরোধ জ্ঞাপন করিবেন যে, অনুরূপ অনুরোধ জ্ঞাপনের তারিখ হইতে দশ দিনের মধ্যে রাষ্ট্রপতি যেন পর্ষদের নিকট পরীক্ষিত হইবার জন্য উপস্থিত হন।',
                textAlign: TextAlign.justify,
              )),
              ListTile(
                  title: Text(
                '(৩) অপসারণের জন্য প্রস্তাবের নোটিশ স্পীকারের নিকট প্রদানের পর হইতে চৌদ্দ দিনের পূর্বে বা ত্রিশ দিনের পর প্রস্তাবটি ভোটে দেওয়া যাইবে না, এবং অনুরূপ মেয়াদের মধ্যে প্রস্তাবটি উত্থাপনের জন্য পুনরায় সংসদ আহ্বানের প্রয়োজন হইলে স্পীকার সংসদ আহ্বান করিবেন।',
                textAlign: TextAlign.justify,
              )),
              ListTile(
                  title: Text(
                '(৪) প্রস্তাবটি বিবেচিত হইবার কালে রাষ্ট্রপতির উপস্থিত থাকিবার এবং প্রতিনিধি প্রেরণের অধিকার থাকিবে।',
                textAlign: TextAlign.justify,
              )),
              ListTile(
                  title: Text(
                '(৫) প্রস্তাবটি সংসদে উত্থাপনের পূর্বে রাষ্ট্রপতি পর্ষদের দ্বারা পরীক্ষিত হইবার জন্য উপস্থিত না হইয়া থাকিলে প্রস্তাবটি ভোটে দেওয়া যাইতে পারিবে এবং সংসদের মোট সদস্য-সংখ্যার অন্যূন দুই-তৃতীয়াংশ ভোটে তাহা গৃহীত হইলে প্রস্তাবটি গৃহীত হইবার তারিখে রাষ্ট্রপতির পদ শূন্য হইবে।',
                textAlign: TextAlign.justify,
              )),
              ListTile(
                  title: Text(
                '(৬) অপসারণের জন্য প্রস্তাবটি সংসদে উস্থাপিত হইবার পূর্বে রাষ্ট্রপতি পর্ষদের নিকট পরীক্ষিত হইবার জন্য উপস্থিত হইয়া থাকিলে সংসদের নিকট পর্ষদের মতামত পেশ করিবার সুযোগ না দেওয়া পর্যন্ত প্রস্তাবটি ভোটে দেওয়া যাইবে না।',
                textAlign: TextAlign.justify,
              )),
              ListTile(
                  title: Text(
                '(৭) সংসদ কর্তৃক প্রস্তাবটি ও পর্ষদের রিপোর্ট (যাহা এই অনুচ্ছেদের (২) দফা অনুসারে পরীক্ষার সাত দিনের মধ্যে দাখিল করা হইবে এবং অনুরূপভাবে দাখিল না করা হইলে তাহা বিবেচনার প্রয়োজন হইবে না) বিবেচিত হইবার পর সংসদের মোট সদস্য-সংখ্যার অন্যূন দুই-তৃতীয়াংশ ভোটে প্রস্তাবটি গৃহীত হইলে তাহা গৃহীত হইবার তারিখে রাষ্ট্রপতি পদ শূন্য হইবে।',
                textAlign: TextAlign.justify,
              )),
            ],
          ),
          ExpansionTile(
            title: Text('৫৪। অনুপস্থিতি প্রভৃতির-কালে রাষ্ট্রপতি-পদে স্পীকার'),
            children: <Widget>[
              ListTile(
                  title: Text(
                '৫৪। রাষ্ট্রপতির পদ শূন্য হইলে কিংবা অনুপস্থিতি, অসুস্থতা বা অন্য কোন কারণে রাষ্ট্রপতি দায়িত্ব পালনে অসমর্থ হইলে ক্ষেত্রমত রাষ্ট্রপতি নির্বাচিত না হওয়া পর্যন্ত কিংবা রাষ্ট্রপতি পুনরায় স্বীয় কার্যভার গ্রহণ না করা পর্যন্ত স্পীকার রাষ্ট্রপতির দায়িত্ব পালন করিবেন।',
                textAlign: TextAlign.justify,
              )),
            ],
          ),
          SizedBox(
            height: 3,
          ),
          Divider(),
          SizedBox(
            height: 3,
          ),
          Text(
            "২য় পরিচ্ছেদঃ প্রধানমন্ত্রী ও মন্ত্রিসভা",
            style: TextStyle(color: Colors.green[900], fontSize: 16),
            textAlign: TextAlign.center,
          ),
          Divider(),
          ExpansionTile(
            title: Text('৫৫। মন্ত্রিসভা'),
            children: <Widget>[
              ListTile(
                  title: Text(
                '৫৫। (১) প্রধানমন্ত্রীর নেতৃত্বে বাংলাদেশের একটি মন্ত্রিসভা থাকিবে এবং প্রধানমন্ত্রী ও সময়ে সময়ে তিনি যেরূপ স্থির করিবেন, সেইরূপ অন্যান্য মন্ত্রী লইয়া এই মন্ত্রিসভা গঠিত হইবে।',
                textAlign: TextAlign.justify,
              )),
              ListTile(
                  title: Text(
                '(২) প্রধানমন্ত্রী কর্তৃক বা তাঁহার কর্তত্বে এই সংবিধান-অনুযায়ী প্রজাতন্ত্রের নির্বাহী ক্ষমতা প্রযুক্ত হইবে।',
                textAlign: TextAlign.justify,
              )),
              ListTile(
                  title: Text(
                '(৪) সরকারের সকল নির্বাহী ব্যবস্থা রাষ্ট্রপতির নামে গৃহীত হইয়াছে বলিয়া প্রকাশ করা হইবে।',
                textAlign: TextAlign.justify,
              )),
              ListTile(
                  title: Text(
                '(৫) রাষ্ট্রপতির নামে প্রণীত আদেশসমূহ ও অন্যান্য চুক্তিপত্র কিরূপে সত্যায়িত বা প্রমাণীকৃত হইবে, রাষ্ট্রপতি তাহা বিধিসমূহ-দ্বারা নির্ধারণ করিবেন এবং অনুরূপভাবে সত্যায়িত বা প্রমাণীকৃত কোন আদেশ বা চুক্তিপত্র যথাযথভাবে প্রণীত বা সম্পাদিত হয় নাই বলিয়া তাহার বৈধতা সম্পর্কে কোন আদালতে প্রশ্ন উত্থাপন করা যাইবে না।',
                textAlign: TextAlign.justify,
              )),
              ListTile(
                  title: Text(
                '(৬) রাষ্ট্রপতি সরকারী কার্যাবলী বন্টন ও পরিচালনার জন্য বিধিসমূহ প্রণয়ন করিবেন।',
                textAlign: TextAlign.justify,
              )),
            ],
          ),
          ExpansionTile(
            title: Text('৫৬। মন্ত্রিগণ'),
            children: <Widget>[
              ListTile(
                  title: Text(
                '৫৬। (১) একজন প্রধানমন্ত্রী থাকিবেন এবং প্রধানমন্ত্রী যেরূপ নির্ধারণ করিবেন, সেইরূপ অন্যান্য মন্ত্রী, প্রতিমন্ত্রী ও উপ-মন্ত্রী থাকিবেন।',
                textAlign: TextAlign.justify,
              )),
              ListTile(
                  title: Text(
                '(২) প্রধানমন্ত্রী ও অন্যান্য মন্ত্রী, প্রতিমন্ত্রী ও উপ-মন্ত্রীদিগকে রাষ্ট্রপতি নিয়োগ দান করিবেন:\nতবে শর্ত থাকে যে, তাঁহাদের সংখ্যার অন্যূন নয়-দশমাংশ সংসদ-সদস্যগণের মধ্য হইতে নিযুক্ত হইবেন এবং অনধিক এক-দশমাংশ সংসদ-সদস্য নির্বাচিত হইবার যোগ্য ব্যক্তিগণের মধ্য হইতে মনোনীত হইতে পারিবেন।',
                textAlign: TextAlign.justify,
              )),
              ListTile(
                  title: Text(
                '(৩) যে সংসদ-সদস্য সংসদের সংখ্যাগরিষ্ঠ সদস্যের আস্থাভাজন বলিয়া রাষ্ট্রপতির নিকট প্রতীয়মান হইবেন, রাষ্ট্রপতি তাঁহাকে প্রধানমন্ত্রী নিয়োগ করিবেন।',
                textAlign: TextAlign.justify,
              )),
              ListTile(
                  title: Text(
                '(৪) সংসদ ভাংগিয়া যাওয়া এবং সংসদ-সদস্যদের অব্যবহিত পরবর্তী সাধারণ নির্বাচন অনুষ্ঠানের মধ্যবর্তীকালে এই অনুচ্ছেদের (২) বা (৩) দফার অধীন নিয়োগ দানের প্রয়োজন দেখা দিলে সংসদ ভাংগিয়া যাইবার অব্যবহিত পূর্বে যাঁহারা সংসদ-সদস্য ছিলেন, এই দফার উদ্দেশ্যসাধনকল্পে তাঁহারা সদস্যরূপে বহাল রহিয়াছেন বলিয়া গণ্য হইবেন।',
                textAlign: TextAlign.justify,
              )),
            ],
          ),
          ExpansionTile(
            title: Text('৫৭। প্রধানমন্ত্রীর পদের মেয়াদ'),
            children: <Widget>[
              ListTile(
                  title: Text(
                '৫৭। (১) প্রধানমন্ত্রীর পদ শূন্য হইবে, যদি- \n(ক) তিনি কোন সময়ে রাষ্ট্রপতির নিকট পদত্যাগপত্র প্রদান করেন; অথবা \n(খ) তিনি সংসদ-সদস্য না থাকেন।',
                textAlign: TextAlign.justify,
              )),
              ListTile(
                  title: Text(
                '(২) সংসদের সংখ্যাগরিষ্ঠ সদস্যের সমর্থন হারাইলে প্রধানমন্ত্রী পদত্যাগ করিবেন কিংবা সংসদ ভাংগিয়া দিবার জন্য লিখিতভাবে রাষ্ট্রপতিকে পরামর্শদান করিবেন এবং তিনি অনুরূপ পরামর্শদান করিলে রাষ্ট্রপতি, অন্য কোন সংসদ-সদস্য সংসদের সংখ্যাগরিষ্ঠ সদস্যের আস্থাভাজন নহেন এই মর্মে সন্তুষ্ট হইলে, সংসদ ভাংগিয়া দিবেন।',
                textAlign: TextAlign.justify,
              )),
              ListTile(
                  title: Text(
                '(৩) প্রধানমন্ত্রীর উত্তরাধিকারী কার্যভার গ্রহণ না করা পর্যন্ত প্রধানমন্ত্রীকে স্বীয় পদে বহাল থাকিতে এই অনুচ্ছেদের কোন কিছুই অযোগ্য করিবে না।',
                textAlign: TextAlign.justify,
              )),
            ],
          ),
          ExpansionTile(
            title: Text('৫৮। অন্যান্য মন্ত্রীর পদের মেয়াদ'),
            children: <Widget>[
              ListTile(
                  title: Text(
                '৫৮। (১) প্রধানমন্ত্রী ব্যতীত অন্য কোন মন্ত্রীর পদ শূন্য হইবে, যদি- \n(ক) তিনি রাষ্ট্রপতির নিকট পেশ করিবার জন্য প্রধানমন্ত্রীর নিকট পদত্যাগপত্র প্রদান করেন; \n(খ) তিনি সংসদ-সদস্য না থাকেন, তবে ৫৬ অনুচ্ছেদের (২) দফার শর্তাংশের অধীনে মনোনীত মন্ত্রীর ক্ষেত্রে ইহা প্রযোজ্য হইবে না; \n(গ) এই অনুচ্ছেদের (২) দফা অনুসারে রাষ্ট্রপতি অনুরূপ নির্দেশ দান করেন; অথবা \n(ঘ) এই অনুচ্ছেদের (৪) দফায় যেরূপ বিধান করা হইয়াছে তাহা কার্যকর হয়।',
                textAlign: TextAlign.justify,
              )),
              ListTile(
                  title: Text(
                '(২) প্রধানমন্ত্রী যে কোন সময়ে কোন মন্ত্রীকে পদত্যাগ করিতে অনুরোধ করিতে পারিবেন এবং উক্ত মন্ত্রী অনুরূপ অনুরোধ পালনে অসমর্থ হইলে তিনি রাষ্ট্রপতিকে উক্ত মন্ত্রীর নিয়োগের অবসান ঘটাইবার পরামর্শ দান করিতে পারিবেন।',
                textAlign: TextAlign.justify,
              )),
              ListTile(
                  title: Text(
                '(৩) সংসদ ভাংগিয়া যাওয়া অবস্থায় যেকোন সময়ে কোন মন্ত্রীকে স্বীয় পদে বহাল থাকিতে এই অনুচ্ছেদের (১) দফার (ক), (খ) ও (ঘ) উপ-দফার কোন কিছুই অযোগ্য করিবে না।',
                textAlign: TextAlign.justify,
              )),
              ListTile(
                  title: Text(
                '(৪) প্রধানমন্ত্রী পদত্যাগ করিলে বা স্বীয় পদে বহাল না থাকিলে মন্ত্রীদের প্রত্যেকে পদত্যাগ করিয়াছেন বলিয়া গণ্য হইবে; তবে এই পরিচ্ছেদের বিধানাবলী-সাপেক্ষে তাঁহাদের উত্তরাধিকারীগণ কার্যভার গ্রহণ না করা পর্যন্ত তাঁহারা স্ব স্ব পদে বহাল থাকিবেন।',
                textAlign: TextAlign.justify,
              )),
              ListTile(
                  title: Text(
                '(৫) এই অনুচ্ছেদে "মন্ত্রী" বলিতে প্রতিমন্ত্রী ও উপ-মন্ত্রী অন্তর্ভুক্ত।',
                textAlign: TextAlign.justify,
              )),
            ],
          ),
          ExpansionTile(
            title: Text('৫৮ক [বিলুপ্ত]'),
            children: <Widget>[],
          ),
          SizedBox(
            height: 3,
          ),
          Divider(),
          SizedBox(
            height: 3,
          ),
          Text(
            "২ক পরিচ্ছেদঃ নির্দলীয় তত্ত্বাবধায়ক সরকার \n[সংবিধান (পঞ্চদশ সংশোধন) আইন, ২০১১ (২০১১ সনের ১৪ নং আইন)-এর ২১ ধারাবলে পরিচ্ছেদটি বিলুপ্ত।]",
            style: TextStyle(color: Colors.green[900], fontSize: 16),
            textAlign: TextAlign.center,
          ),
          Divider(),
          SizedBox(
            height: 3,
          ),
          Text(
            "৩য় পরিচ্ছেদঃ স্থানীয় শাসন",
            style: TextStyle(color: Colors.green[900], fontSize: 16),
            textAlign: TextAlign.center,
          ),
          Divider(),
          ExpansionTile(
            title: Text('৫৯। স্থানীয় শাসন'),
            children: <Widget>[
              ListTile(
                  title: Text(
                '৫৯। (১) আইনানুযায়ী নির্বাচিত ব্যক্তিদের সমন্বয়ে গঠিত প্রতিষ্ঠানসমূহের উপর প্রজাতন্ত্রের প্রত্যেক প্রশাসনিক একাংশের স্থানীয় শাসনের ভার প্রদান করা হইবে।',
                textAlign: TextAlign.justify,
              )),
              ListTile(
                  title: Text(
                '(২) এই সংবিধান ও অন্য কোন আইন-সাপেক্ষে সংসদ আইনের দ্বারা যেরূপ নির্দিষ্ট করিবেন, এই অনুচ্ছেদের (১) দফায় উল্লিখিত প্রত্যেক প্রতিষ্ঠান যথোপযুক্ত প্রশাসনিক একাংশের মধ্যে সেইরূপ দায়িত্ব পালন করিবেন এবং অনুরূপ আইনে নিম্নলিখিত বিষয় সংক্রান্ত দায়িত্ব অন্তর্ভুক্ত হইতে পারিবে: \n(ক) প্রশাসন ও সরকারী কর্মচারীদের কার্য; \n(খ) জনশৃংখলা রক্ষা; \n(গ) জনসাধারণের কার্য ও অর্থনৈতিক উন্নয়ন সম্পর্কিত পরিকল্পনা প্রণয়ন ও বাস্তবায়ন।',
                textAlign: TextAlign.justify,
              )),
            ],
          ),
          ExpansionTile(
            title: Text('৬০। স্থানীয় শাসন সংক্রান্ত প্রতিষ্ঠানের ক্ষমতা'),
            children: <Widget>[
              ListTile(
                  title: Text(
                '৬০। এই সংবিধানের ৫৯ অনুচ্ছেদের বিধানাবলীকে পূর্ণ কার্যকরতাদানের উদ্দেশ্যে সংসদ আইনের দ্বারা উক্ত অনুচ্ছেদে উল্লিখিত স্থানীয় শাসন সংক্রান্ত প্রতিষ্ঠানসমূহকে স্থানীয় প্রয়োজনে কর আরোপ করিবার ক্ষমতাসহ বাজেট প্রস্তুতকরণ ও নিজস্ব তহবিল রক্ষণাবেক্ষণের ক্ষমতা প্রদান করিবেন।',
                textAlign: TextAlign.justify,
              )),
            ],
          ),
          SizedBox(
            height: 3,
          ),
          Divider(),
          SizedBox(
            height: 3,
          ),
          Text(
            "৪র্থ পরিচ্ছেদঃ প্রতিরক্ষা কর্মবিভাগ",
            style: TextStyle(color: Colors.green[900], fontSize: 16),
            textAlign: TextAlign.center,
          ),
          Divider(),
          ExpansionTile(
            title: Text('৬১। সর্বাধিনায়কতা'),
            children: <Widget>[
              ListTile(
                  title: Text(
                '৬১। বাংলাদেশের প্রতিরক্ষা কর্মবিভাগসমূহের সর্বাধিনায়কতা রাষ্ট্রপতির উপর ন্যস্ত হইবে এবং আইনের দ্বারা তাহার প্রয়োগ নিয়ন্ত্রিত হইবে।',
                textAlign: TextAlign.justify,
              )),
            ],
          ),
          ExpansionTile(
            title: Text('৬২। প্রতিরক্ষা কর্মবিভাগে ভর্তি প্রভৃতি'),
            children: <Widget>[
              ListTile(
                  title: Text(
                '৬২। (১) সংসদ আইনের দ্বারা নিম্নলিখিত বিষয়সমূহ নিয়ন্ত্রণ করিবেন: \n(ক) বাংলাদেশের প্রতিরক্ষা কর্মবিভাগসমূহ ও উক্ত কর্মবিভাগসমূহের সংরক্ষিত অংশসমূহ গঠন ও রক্ষণাবেক্ষণ; \n(খ) উক্ত কর্মবিভাগসমূহে কমিশন মঞ্জুরী; \n(গ) প্রতিরক্ষা-বাহিনীসমূহের প্রধানদের নিয়োগদান ও তাঁহাদের বেতন ও ভাতা-নির্ধারণ; এবং \n(ঘ) উক্ত কর্মবিভাগসমূহ ও সংরক্ষিত অংশসমূহ-সংক্রান্ত শৃঙ্খলামূলক ও অন্যান্য বিষয়।',
                textAlign: TextAlign.justify,
              )),
              ListTile(
                  title: Text(
                '(২) সংসদ আইনের দ্বারা এই অনুচ্ছেদের (১) দফায় বর্ণিত বিষয়সমূহের জন্য বিধান না করা পর্যন্ত অনুরূপ যে সকল বিষয় প্রচলিত আইনের অধীন নহে, রাষ্ট্রপতি আদেশের দ্বারা সেই সকল বিষয়ের জন্য বিধান করিতে পারিবেন।',
                textAlign: TextAlign.justify,
              )),
            ],
          ),
          ExpansionTile(
            title: Text('৬৩। যুদ্ধ'),
            children: <Widget>[
              ListTile(
                  title: Text(
                '৬৩। (১) সংসদের সম্মতি ব্যতীত যুদ্ধ ঘোষণা করা যাইবে না কিংবা প্রজাতন্ত্র কোন যুদ্ধে অংশ গ্রহণ করিবেন না।',
                textAlign: TextAlign.justify,
              )),
            ],
          ),
          SizedBox(
            height: 3,
          ),
          Divider(),
          SizedBox(
            height: 3,
          ),
          Text(
            "৫ম পরিচ্ছেদঃ অ্যাটর্ণি -জেনারেল",
            style: TextStyle(color: Colors.green[900], fontSize: 16),
            textAlign: TextAlign.center,
          ),
          Divider(),
          ExpansionTile(
            title: Text('৬৪। অ্যাটর্ণি-জেনারেল'),
            children: <Widget>[
              ListTile(
                  title: Text(
                '৬৪। (১) সুপ্রীম কোর্টের বিচারক হইবার যোগ্য কোন ব্যক্তিকে রাষ্ট্রপতি বাংলাদেশের অ্যাটর্ণি-জেনারেল পদে নিয়োগদান করিবেন।',
                textAlign: TextAlign.justify,
              )),
              ListTile(
                  title: Text(
                '(২) অ্যাটর্ণি-জেনারেল রাষ্ট্রপতি কর্তৃক প্রদত্ত সকল দায়িত্ব পালন করিবেন।',
                textAlign: TextAlign.justify,
              )),
              ListTile(
                  title: Text(
                '(৩) অ্যাটর্ণি-জেনারেলের দায়িত্ব পালনের জন্য বাংলাদেশের সকল আদালতে তাঁহার বক্তব্য পেশ করিবার অধিকার থাকিবে।',
                textAlign: TextAlign.justify,
              )),
              ListTile(
                  title: Text(
                '(৪) রাষ্ট্রপতির সন্তোষানুযায়ী সময়সীমা পর্যন্ত অ্যাটর্ণি-জেনারেল স্বীয় পদে বহাল থাকিবেন এবং রাষ্ট্রপতি কর্তৃক নির্ধারিত পারিশ্রমিক লাভ করিবেন।',
                textAlign: TextAlign.justify,
              )),
            ],
          ),
        ],
      ),
    );
  }
}
